xylafur/CCS_Base/common/targetdb/Modules/C2000/f28004x_output_xbar_regs.xml
<module id="OUTPUT_XBAR_REGS" HW_revision="" description="OUTPUT XBAR Registers">
	<register id="OUTPUT1MUX0TO15CFG" width="32" page="1" offset="0x0" internal="0" description="Output X-BAR Mux Configuration for Output 1">
		<bitfield id="MUX0" description="Mux0 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="MUX1" description="Mux1 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="MUX2" description="Mux2 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="MUX3" description="Mux3 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="MUX4" description="Mux4 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="MUX5" description="Mux5 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="MUX6" description="Mux6 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="MUX7" description="Mux7 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="MUX8" description="Mux8 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="MUX9" description="Mux9 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="MUX10" description="Mux10 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="MUX11" description="Mux11 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="MUX12" description="Mux12 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="MUX13" description="Mux13 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="MUX14" description="Mux14 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="MUX15" description="Mux15 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="OUTPUT1MUX16TO31CFG" width="32" page="1" offset="0x2" internal="0" description="Output X-BAR Mux Configuration for Output 1">
		<bitfield id="MUX16" description="Mux16 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="MUX17" description="Mux17 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="MUX18" description="Mux18 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="MUX19" description="Mux19 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="MUX20" description="Mux20 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="MUX21" description="Mux21 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="MUX22" description="Mux22 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="MUX23" description="Mux23 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="MUX24" description="Mux24 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="MUX25" description="Mux25 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="MUX26" description="Mux26 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="MUX27" description="Mux27 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="MUX28" description="Mux28 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="MUX29" description="Mux29 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="MUX30" description="Mux30 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="MUX31" description="Mux31 Configuration for OUTPUT1 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="OUTPUT2MUX0TO15CFG" width="32" page="1" offset="0x4" internal="0" description="Output X-BAR Mux Configuration for Output 2">
		<bitfield id="MUX0" description="Mux0 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="MUX1" description="Mux1 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="MUX2" description="Mux2 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="MUX3" description="Mux3 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="MUX4" description="Mux4 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="MUX5" description="Mux5 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="MUX6" description="Mux6 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="MUX7" description="Mux7 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="MUX8" description="Mux8 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="MUX9" description="Mux9 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="MUX10" description="Mux10 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="MUX11" description="Mux11 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="MUX12" description="Mux12 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="MUX13" description="Mux13 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="MUX14" description="Mux14 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="MUX15" description="Mux15 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="OUTPUT2MUX16TO31CFG" width="32" page="1" offset="0x6" internal="0" description="Output X-BAR Mux Configuration for Output 2">
		<bitfield id="MUX16" description="Mux16 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="MUX17" description="Mux17 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="MUX18" description="Mux18 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="MUX19" description="Mux19 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="MUX20" description="Mux20 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="MUX21" description="Mux21 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="MUX22" description="Mux22 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="MUX23" description="Mux23 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="MUX24" description="Mux24 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="MUX25" description="Mux25 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="MUX26" description="Mux26 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="MUX27" description="Mux27 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="MUX28" description="Mux28 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="MUX29" description="Mux29 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="MUX30" description="Mux30 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="MUX31" description="Mux31 Configuration for OUTPUT2 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
