xylafur/CCS_Base/common/targetdb/Modules/C2000/f28004x_output_xbar_regs.xml
	<register id="OUTPUT6MUXENABLE" width="32" page="1" offset="0x2a" internal="0" description="Output X-BAR Mux Enable  for Output 6">
		<bitfield id="MUX0" description="mux0 to drive OUTPUT6 of OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="MUX1" description="Mux1 to drive OUTPUT6 of OUTPUT-XBAR" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="MUX2" description="Mux2 to drive OUTPUT6 of OUTPUT-XBAR" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="MUX3" description="Mux3 to drive OUTPUT6 of OUTPUT-XBAR" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="MUX4" description="Mux4 to drive OUTPUT6 of OUTPUT-XBAR" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="MUX5" description="Mux5 to drive OUTPUT6 of OUTPUT-XBAR" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="MUX6" description="Mux6 to drive OUTPUT6 of OUTPUT-XBAR" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="MUX7" description="Mux7 to drive OUTPUT6 of OUTPUT-XBAR" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="MUX8" description="Mux8 to drive OUTPUT6 of OUTPUT-XBAR" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="MUX9" description="Mux9 to drive OUTPUT6 of OUTPUT-XBAR" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="MUX10" description="Mux10 to drive OUTPUT6 of OUTPUT-XBAR" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="MUX11" description="Mux11 to drive OUTPUT6 of OUTPUT-XBAR" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="MUX12" description="Mux12 to drive OUTPUT6 of OUTPUT-XBAR" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="MUX13" description="Mux13 to drive OUTPUT6 of OUTPUT-XBAR" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="MUX14" description="Mux14 to drive OUTPUT6 of OUTPUT-XBAR" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="MUX15" description="Mux15 to drive OUTPUT6 of OUTPUT-XBAR" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="MUX16" description="Mux16 to OUTPUT6 of OUTPUT-XBAR" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="MUX17" description="Mux17 to drive OUTPUT6 of OUTPUT-XBAR" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="MUX18" description="Mux18 to drive OUTPUT6 of OUTPUT-XBAR" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="MUX19" description="Mux19 to drive OUTPUT6 of OUTPUT-XBAR" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="MUX20" description="Mux20 to drive OUTPUT6 of OUTPUT-XBAR" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="MUX21" description="Mux21 to drive OUTPUT6 of OUTPUT-XBAR" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="MUX22" description="Mux22 to drive OUTPUT6 of OUTPUT-XBAR" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="MUX23" description="Mux23 to drive OUTPUT6 of OUTPUT-XBAR" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="MUX24" description="Mux24 to drive OUTPUT6 of OUTPUT-XBAR" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="MUX25" description="Mux25 to drive OUTPUT6 of OUTPUT-XBAR" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="MUX26" description="Mux26 to drive OUTPUT6 of OUTPUT-XBAR" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="MUX27" description="Mux27 to drive OUTPUT6 of OUTPUT-XBAR" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="MUX28" description="Mux28 to drive OUTPUT6 of OUTPUT-XBAR" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="MUX29" description="Mux29 to drive OUTPUT6 of OUTPUT-XBAR" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="MUX30" description="Mux30 to drive OUTPUT6 of OUTPUT-XBAR" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="MUX31" description="Mux31 to drive OUTPUT6 of OUTPUT-XBAR" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="OUTPUT7MUXENABLE" width="32" page="1" offset="0x2c" internal="0" description="Output X-BAR Mux Enable  for Output 7">
		<bitfield id="MUX0" description="mux0 to drive OUTPUT7 of OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="MUX1" description="Mux1 to drive OUTPUT7 of OUTPUT-XBAR" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="MUX2" description="Mux2 to drive OUTPUT7 of OUTPUT-XBAR" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="MUX3" description="Mux3 to drive OUTPUT7 of OUTPUT-XBAR" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="MUX4" description="Mux4 to drive OUTPUT7 of OUTPUT-XBAR" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="MUX5" description="Mux5 to drive OUTPUT7 of OUTPUT-XBAR" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="MUX6" description="Mux6 to drive OUTPUT7 of OUTPUT-XBAR" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="MUX7" description="Mux7 to drive OUTPUT7 of OUTPUT-XBAR" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="MUX8" description="Mux8 to drive OUTPUT7 of OUTPUT-XBAR" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="MUX9" description="Mux9 to drive OUTPUT7 of OUTPUT-XBAR" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="MUX10" description="Mux10 to drive OUTPUT7 of OUTPUT-XBAR" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="MUX11" description="Mux11 to drive OUTPUT7 of OUTPUT-XBAR" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="MUX12" description="Mux12 to drive OUTPUT7 of OUTPUT-XBAR" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="MUX13" description="Mux13 to drive OUTPUT7 of OUTPUT-XBAR" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="MUX14" description="Mux14 to drive OUTPUT7 of OUTPUT-XBAR" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="MUX15" description="Mux15 to drive OUTPUT7 of OUTPUT-XBAR" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="MUX16" description="Mux16 to drive OUTPUT7 of OUTPUT-XBAR" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="MUX17" description="Mux17 to drive OUTPUT7 of OUTPUT-XBAR" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="MUX18" description="Mux18 to drive OUTPUT7 of OUTPUT-XBAR" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="MUX19" description="Mux19 to drive OUTPUT7 of OUTPUT-XBAR" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="MUX20" description="Mux20 to drive OUTPUT7 of OUTPUT-XBAR" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="MUX21" description="Mux21 to drive OUTPUT7 of OUTPUT-XBAR" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="MUX22" description="Mux22 to drive OUTPUT7 of OUTPUT-XBAR" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="MUX23" description="Mux23 to drive OUTPUT7 of OUTPUT-XBAR" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="MUX24" description="Mux24 to drive OUTPUT7 of OUTPUT-XBAR" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="MUX25" description="Mux25 to drive OUTPUT7 of OUTPUT-XBAR" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="MUX26" description="Mux26 to drive OUTPUT7 of OUTPUT-XBAR" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="MUX27" description="Mux27 to drive OUTPUT7 of OUTPUT-XBAR" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="MUX28" description="Mux28 to drive OUTPUT7 of OUTPUT-XBAR" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="MUX29" description="Mux29 to drive OUTPUT7 of OUTPUT-XBAR" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="MUX30" description="Mux30 to drive OUTPUT7 of OUTPUT-XBAR" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="MUX31" description="Mux31 to drive OUTPUT7 of OUTPUT-XBAR" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="OUTPUT8MUXENABLE" width="32" page="1" offset="0x2e" internal="0" description="Output X-BAR Mux Enable  for Output 8">
		<bitfield id="MUX0" description="mux0 to drive OUTPUT8 of OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="MUX1" description="Mux1 to drive OUTPUT8 of OUTPUT-XBAR" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="MUX2" description="Mux2 to drive OUTPUT8 of OUTPUT-XBAR" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="MUX3" description="Mux3 to drive OUTPUT8 of OUTPUT-XBAR" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="MUX4" description="Mux4 to drive OUTPUT8 of OUTPUT-XBAR" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="MUX5" description="Mux5 to drive OUTPUT8 of OUTPUT-XBAR" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="MUX6" description="Mux6 to drive OUTPUT8 of OUTPUT-XBAR" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="MUX7" description="Mux7 to drive OUTPUT8 of OUTPUT-XBAR" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="MUX8" description="Mux8 to drive OUTPUT8 of OUTPUT-XBAR" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="MUX9" description="Mux9 to drive OUTPUT8 of OUTPUT-XBAR" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="MUX10" description="Mux10 to drive OUTPUT8 of OUTPUT-XBAR" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="MUX11" description="Mux11 to drive OUTPUT8 of OUTPUT-XBAR" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="MUX12" description="Mux12 to drive OUTPUT8 of OUTPUT-XBAR" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="MUX13" description="Mux13 to drive OUTPUT8 of OUTPUT-XBAR" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="MUX14" description="Mux14 to drive OUTPUT8 of OUTPUT-XBAR" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="MUX15" description="Mux15 to drive OUTPUT8 of OUTPUT-XBAR" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="MUX16" description="Mux16 to drive OUTPUT8 of OUTPUT-XBAR" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="MUX17" description="Mux17 to drive OUTPUT8 of OUTPUT-XBAR" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="MUX18" description="Mux18 to drive OUTPUT8 of OUTPUT-XBAR" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="MUX19" description="Mux19 to drive OUTPUT8 of OUTPUT-XBAR" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="MUX20" description="Mux20 to drive OUTPUT8 of OUTPUT-XBAR" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="MUX21" description="Mux21 to drive OUTPUT8 of OUTPUT-XBAR" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="MUX22" description="Mux22 to drive OUTPUT8 of OUTPUT-XBAR" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="MUX23" description="Mux23 to drive OUTPUT8 of OUTPUT-XBAR" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="MUX24" description="Mux24 to drive OUTPUT8 of OUTPUT-XBAR" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="MUX25" description="Mux25 to drive OUTPUT8 of OUTPUT-XBAR" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="MUX26" description="Mux26 to drive OUTPUT8 of OUTPUT-XBAR" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="MUX27" description="Mux27 to drive OUTPUT8 of OUTPUT-XBAR" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="MUX28" description="Mux28 to drive OUTPUT8 of OUTPUT-XBAR" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="MUX29" description="Mux29 to drive OUTPUT8 of OUTPUT-XBAR" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="MUX30" description="Mux30 to drive OUTPUT8 of OUTPUT-XBAR" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="MUX31" description="Mux31 to drive OUTPUT8 of OUTPUT-XBAR" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
